_org_posts/_posts/2021-12-14-boj-1662.org
#+HTML: ---
#+HTML: layout: post
#+HTML: title: BOJ 1662 압축
#+HTML: tags: 스택
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 1662 압축

** 접근하기
#+BEGIN_EXAMPLE
33(562(71(9)))
33(562(79))
3567979567979567979 -> 19
#+END_EXAMPLE

** 코드 - 메모리 초과
- tmp string에 계속 값을 저장하고, stack에 push한 후, stack size를 재면 된다.
- 메모리 초과 발생
#+BEGIN_SRC cpp
// 메모리 초과 풀이
#include <cstdio>
#include <stack>
#include <string>
using namespace std;

stack<char> st;
char str[60];
string tmp;

int main(int argc, char* argv[])
{
    scanf("%s", str);
    for(int i=0;str[i];i++) {
        
        if (str[i] == ')') {
            tmp = "";
            while(st.top() != '(') {
                char ch = st.top();st.pop();
                tmp += ch;
            }
            st.pop(); // remove '('

            char num = st.top(); st.pop();
            int len = tmp.size();
            for(int i=0;i<(num-'0');i++) {
                for(int j=len-1;j>=0;j--) {
                    st.push(tmp[j]); // 메모리를 많이 소모
                }
            }
        } else {
            st.push(str[i]);
        }
    }
    printf("%d\n", (int)st.size());
    return 0;
}
#+END_SRC

** 코드 - 숫자의 길이를 저장하고 따로 계산
#+BEGIN_SRC cpp
#include <cstdio>
#include <stack>
using namespace std;

typedef struct Node {
    int num;
    int len;    
} Node;

stack<Node> st;
char str[60];

int main(int argc, char* argv[])
{
    scanf("%s", str);
    for(int i=0;str[i];i++) {
        
        if (str[i] == ')') {
            int len = 0;

            while(st.top().num != -1) {
                int l = st.top().len;
                st.pop();
                len += l;
            }
            st.pop();
            int num = st.top().num;
            st.pop();
            st.push({num, len * num});
        } else {
            if (str[i] == '(') {
                st.push({-1, 1});
            } else {
                st.push({str[i] - '0', 1});
            }
        }
    }
    int ans = 0;
    while(!st.empty()) {
        ans += st.top().len;
        st.pop();
    }
    printf("%d\n", ans);
    return 0;
}
#+END_SRC
** TODO 코드 - DFS 풀이
- 참고 https://hwan-shell.tistory.com/305
** 문제 링크
- https://www.acmicpc.net/problem/1662
