_posts/2021-12-14-boj-1662.html
---
title: BOJ 1662 압축
tags: 스택
toc: true
toc_sticky: true
---

<div id="outline-container-org53572bf" class="outline-2">
<h2 id="org53572bf">BOJ 1662 압축</h2>
</div>

<div id="outline-container-org61f9b05" class="outline-2">
<h2 id="org61f9b05">접근하기</h2>
<div class="outline-text-2" id="text-org61f9b05">
<pre class="example">
33(562(71(9)))
33(562(79))
33(567979)
3567979567979567979 -&gt; 19
</pre>
</div>
</div>

<div id="outline-container-org51dd5d6" class="outline-2">
<h2 id="org51dd5d6">코드 - 메모리 초과</h2>
<div class="outline-text-2" id="text-org51dd5d6">
<ul class="org-ul">
<li>tmp string에 계속 값을 저장하고, stack에 push한 후, stack size를 재면 된다.</li>
<li>메모리 초과 발생</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #888a85;">// </span><span style="color: #888a85;">&#47700;&#47784;&#47532; &#52488;&#44284; &#54400;&#51060;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;stack&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;string&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">stack</span>&lt;<span style="color: #8ae234; font-weight: bold;">char</span>&gt; <span style="color: #ff6347;">st</span>;
<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[60];
<span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">tmp</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;str[i];i++) {

        <span style="color: #729fcf; font-weight: bold;">if</span> (str[i] == <span style="color: #ad7fa8; font-style: italic;">')'</span>) {
            tmp = <span style="color: #ad7fa8; font-style: italic;">""</span>;
            <span style="color: #729fcf; font-weight: bold;">while</span>(st.top() != <span style="color: #ad7fa8; font-style: italic;">'('</span>) {
                <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">ch</span> = st.top();st.pop();
                tmp += ch;
            }
            st.pop(); <span style="color: #888a85;">// </span><span style="color: #888a85;">remove '('</span>

            <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">num</span> = st.top(); st.pop();
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">len</span> = tmp.size();
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;(num-<span style="color: #ad7fa8; font-style: italic;">'0'</span>);i++) {
                <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=len-1;j&gt;=0;j--) {
                    st.push(tmp[j]); <span style="color: #888a85;">// </span><span style="color: #888a85;">&#47700;&#47784;&#47532;&#47484; &#47566;&#51060; &#49548;&#47784;</span>
                }
            }
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            st.push(str[i]);
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, (<span style="color: #8ae234; font-weight: bold;">int</span>)st.size());
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1e05ee" class="outline-2">
<h2 id="orgf1e05ee">코드 - 숫자의 길이를 저장하고 따로 계산</h2>
<div class="outline-text-2" id="text-orgf1e05ee">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;stack&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">len</span>;    
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">stack</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">st</span>;
<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[60];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;str[i];i++) {

        <span style="color: #729fcf; font-weight: bold;">if</span> (str[i] == <span style="color: #ad7fa8; font-style: italic;">')'</span>) {
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">len</span> = 0;

            <span style="color: #729fcf; font-weight: bold;">while</span>(st.top().num != -1) {
                <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">l</span> = st.top().len;
                st.pop();
                len += l;
            }
            st.pop();
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span> = st.top().num;
            st.pop();
            st.push({num, len * num});
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            <span style="color: #729fcf; font-weight: bold;">if</span> (str[i] == <span style="color: #ad7fa8; font-style: italic;">'('</span>) {
                st.push({-1, 1});
            } <span style="color: #729fcf; font-weight: bold;">else</span> {
                st.push({str[i] - <span style="color: #ad7fa8; font-style: italic;">'0'</span>, 1});
            }
        }
    }
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">while</span>(!st.empty()) {
        ans += st.top().len;
        st.pop();
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org0eb8d33" class="outline-2">
<h2 id="org0eb8d33"><span class="todo TODO">TODO</span> 코드 - DFS 풀이</h2>
<div class="outline-text-2" id="text-org0eb8d33">
<ul class="org-ul">
<li>참고 <a href="https://hwan-shell.tistory.com/305">https://hwan-shell.tistory.com/305</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb5a3328" class="outline-2">
<h2 id="orgb5a3328">문제 링크</h2>
<div class="outline-text-2" id="text-orgb5a3328">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/1662">https://www.acmicpc.net/problem/1662</a></li>
</ul>
</div>
</div>
